[{"reviews": ["I am yet to meet somebody who doesn't LOVE Black Dog Smoke & Ale House. This little hole in the wall packs genuine barbeque cuisine unlike anywhere in the vicinity of C-U. Yes, you may have heard it's a small restaurant with a perpetually long wait, but it's worth walking around adorable downtown Urbana for awhile before you're seated. I've also done a carry-out with several other people which only took about 25 minutes to prepare.There's a variety of BBQ sauces from mild to hot listed and detailed on the menu. My personal favorite is the Texas Sauce; it has that smoky flavor I expect out of Midwestern Barbeque. Also, you haven't really lived until you've tried the brisket sandwich.As for side dishes, my friends and I swear by the Twice Baked Potato Casserole. The sweet potato fries are irresistibly sweet and caramelized. Overall, Black Dog provides a one of a kind cuisine. Also VEGETARIANS-- there are some delicious options for you, too.", "Why I haven't reviewed this place sooner is a mystery to me. Downtown Urbana has become a much better place since the opening of Black Dog. BD has become one of my regular dinner spots, their meals hardly ever disappoint. The only drawback is the waiting, sometimes you stroll right in and get seated, other times, it's an hour wait. The wait staff is very hit or miss, I have a few favorite waiters (yup, guys) and one waitress that I think are helpful, attentive, and funny. What to eat: Appetizers: smoked chicken wings, smoked artichoke dip (AMAZING!) Meats: anything pork (seriously), smoked chicken (I MUST try their brisket)Sides: fries, beans, slaw, twice baked potato casserole (I must try their sweet potato fries)Meh: Cuban sandwich -- while it's the best one in town, I was a bit disappointed in its size and it's good, but not excellent. That said, I might give it a second try.Misses: Chicken salad (new) and their very popular corn bread (sorry, it's all of that meat in it, for some reason I just can't like it!)I was just there this past Tuesday and am already planning my return. 4/5 stars because of the long waiting, running out of food quickly (though who can blame the hoards of hungry customers?!), and the hit-or-miss wait staff-I HIGHLY recommend this place the food is excellent, the drinks are good, and the prices are very fair", "Good BBQ, but it didn't really 'wow' me. Possibly it's because I didn't get the burnt ends, but they were out of that by the time I strolled in on a Saturday night. Wasn't too long of a wait for me, only about 2 couples ahead of me and the gf. Got seated at the bar and had an unfriendly waitress. She just seemed stressed and unhappy. Heard her say to another table that it was a long day, so tried not to bother her with anything. I waited until she left and asked another waitress for a different bbq sauce with my meal ha. Anyway, I ordered the rib tips since they guy next to me got it and it looked delicious. It was alright, nothing crazy. I got one of the vinegar bbq sauces first and didn't like it at all. That's when I got the Georgia one which was a lot better and thicker. The twice baked potato casserole, I think it was called, was delicious. The potato salad was meh, you could probably skip on that. The gf got the chicken salad which came with a bunch of crackers. It was a different style on chicken salad so not really sure what to compare it too. It was alright though. We also split some corn bread and that was meh too. I think it was over hyped in my mind from some of these other reviews. Over all it was alright, wasn't too expensive either and you get a pretty decent amount of food. Had to take some home since there was so much so that's always a positive. One day I'll try those burnt ends....one day....", "Best. Corn. Bread. Ever. If your mama ain't around slap someone else. Rib tips are sublime. Digging into my Burnt Ends now. Coleslaw was meh. Everything else was worth the wait.", "Aside from the AMAZING rib tips, the drinks were fantastic. We asked the bartender to \"surprise us\", and he definitely did. A margarita on the rocks with jalapeno tequila...best drink I've ever had.", "This restaurant is a MUST if you are in the Champaign/Urbana area.The food, the drink, and the service are all WONDERFUL. I ordered the brisket and catfish as my proteins and beans and cornbread as my sides. The brisket and beans were my favorite food items: the brisket was smokey and moist and the beans were moderately spicy and were made with drippings from the brisket, YUM! The catfish was nothing to write home about but with the flight of sauces that I ordered I was able to pair it up with a sauce that made it more interesting (favorite sauces were the Georgia Peach, Texas BBQ, and Carolina vinegar). I also ordered the top-shelf bourbon flight which had the best bourbon I've ever tasted, 20 year Pappy Van Winkle! The pours were large which was a pleasant surprise for a top-shelf flight, much appreciated.As far as service goes, I have never had such a welcoming, fun-loving, and informed server as I did at Black Dog. Everyone at the place made our 8 top feel like they were happy we were there and wanted us to love everything we ate, and we most certainly did. I will definitely be back, again and again and again.", "I adore Black Dog. If not for the health concerns, I would have eaten here every week when I was on campus. I would definitely go for the burnt ends, but they sell like hot cakes, so make sure you get there early or order ahead of time.I was interviewing the owner and staff for an article, and everyone was beyond passionate about their food. As I was taken back to see the smoking rack, I was happy to see the staff joking and laughing with each other. They seemed so at ease and seemed to enjoy their work. From the bartenders to the wait staff to the chefs, everything is bar none here. It shows in the quality of the bbq and the excellent drink recommendations made.I've seen people get the whiskey fleet and be awed by the beautiful presentation. Plus, there's nothing better than a spot of whiskey, burnt ends, pulled pork, mashed potatoes and some sweet potato fries. Better hit the gym afterwards, but you know it'll be worth it.", "Black dog is seriously worth the wait. I came during lunch on a weekend and had a 30-40 minute wait, but the food came out quite quickly and the staff are so nice that it didn't matter.I ordered the brisket sandwich, slaw on the side with cornbread. I don't think I could've ordered anything better because I was in actual BBQ heaven. While I wanted to get the burnt ends I was unfortunately out of luck as they had already sold out - I have heard rave reviews from all my die-hard friends and one day I will get my hands on those meaty bits of goodness. For those that are looking to drink, they have a pretty diverse selection of beer to choose from, and it's constantly changing. I got the Green Flash double stout which I'd definitely recommend if it's still on the menu! A++ BD.", "Good in every imaginable way.", "Came at 5:30pm the Friday of homecoming  seeking and was sat by 6. Have a great seat by the window, a little breezy with the door, but get to look down the restaurant and outside.  Fun watching people write their names on the sign in board.  It was nice that we could have a drink while we waiting outside.  We were also able to look at menus while we waited so we didn't lose time.  We were able to order as soon as we were seated.First they have a great selection of hard ciders.  So for the non-beer drinker I can say hurray! First round for appetizer we had the cornbread...oh yeah delicious.  There were 3 of us doing the geometry to divide it up so we each got the same amount.  If we didn't have a ton of other food coming we would have ordered another.I had the pulled pork with the special chipotle slaw, baked beans, twice baked casserole.  OMG the chipotle slaw was so good on the pork that I ordered another side so I could finish my pork with it.  The smoke in the beans is no joke.  I mean they need to bottle and sell this.  I could eat it all the time.  So good I mixed it into the already amazing twice baked potato casserole.  Heaven! Mom had the beef brisket with chipotle slaw with twice bake casserole.  Needless to say, it was eaten with enjoyment.! The brisket just melted in the mouth.  And she was so happy when I ordered more of the chipotle slaw, it also complemented the brisket quite nicely.Dad had ribs, brisket, and polish sausage with the special side of green beans and smoked sweet potato. As with the rest of the meal yum!  The ribs fell of the bone.  And the pairing of the sausage and the Texas sauce was perfect.I just never had a bad bite.  In fact we enjoyed our meal so much that my mom is even considering we come back tomorrow night in our way back out of town.If you are in Urbana you MUST eat here!", "Winner, winner, BBQ dinner!? Yes! TL;DR Quality BBQ here and easily one of the best places to eat in CU area.We signed in our group of 5 at 3:30 and were seated at 4 on a Saturday, get there early!My family are sort of BBQ fanatics, we had to try 3 different places in Memphis last time we were down, so seeing Black Dog rated highly on Yelp, we had to go when they came down to visit!Most of us had some variety of beef brisket while my grandmother also got ribs and my grandfather the chicken.We thought the brisket was tender and flavorful and not overly fatty. We tried some of the ribs too and really liked them! Very thick and meaty rather than fall-off-the bone style, which some people prefer. My grandfather said the chicken was good, but he did not like the side of cornbread that came with it. A traditional southerner, this cornbread was more muffin-style and too sweet for his preferences (I thought it was good). We also did like the twice baked casserole, French fries and sweet potato fries that were on the side, as well as the slaw that was on our sandwiches.Service was good but at the end a little slow to take our check due to a shift change, not a big deal!Now come my only 2 complaints. Complaint #1 would have to be that Black Dog is pretty stingy with their sauces. What came on the sandwiches was hardly anything, probably less than your average BBQ eater would like. We tried 3 different sauces I believe the hot peach, Texas and one other one, they all appeared to be good but I really cant provide an accurate taste test because we had so little of it! We also did not want to pay an extra $0.25 for extra, although my father did anyway because he's a sauce maniac! My other complaint is that the portion size was probably smaller than most BBQ places for the price. Our sandwiches were $9 and they came with one side which varied in size based on what we got. I had the casserole which was just a little cup, whereas my mom had a decent portion of sweet potato fries. I didn't leave hungry but I would probably get the combo or platter next time!Overall Black Dog has really great food for its location and I really like how I don't have to go to Memphis to get similar quality BBQ. It's nice to know that there is a local place that is very successful and also with great food and beer to go along with it.I'll definitely be back!", "Amazing BBQ! Friends recommended we stop here on a road trip. They did not steer us wrong!I had no idea how good Illinois BBQ could be. The meats, especially the burnt ends, were succulent and smoky. You don't even need the sauce. We also got the mustard sauce and the Carolina red sauce. Both were mouthwateringly good. We were also pleased by how great the slaw and side salad were. The greens were organic, local and fresh, and the vinaigrette dressing was delicious. It's not every day you go to a BBQ place with great salad.Service was perfect. Such a nice waiter.", "You've gotta come check out Black Dog! They're usually packed, so be sure to come in early! This is definitely one of the better BBQ I've had. The corn bread here is ridiculously good. Be sure to try some of that. Just be careful as it's addicting! I've always found myself buying extra so I can bring it home!Anyways, I always get a sampler of everything there. The brisket and ribs are definitely my favorites there. You can't go wrong with that.They also have some amazing service. From the moment I walked in, there was a guy (forgot his name) that was very inviting and with a great sense of humor. Wish I can go back, but I'm back in LA!", "Wonderful meal! Came here with our toddler after seeing a game at UIUC at about 9:00. Wait staff is phenomenal. They were out of many things, but we were prepared for this thanks to other Yelpers. What we were able to get was PHENOMENAL. Had the flight of sauces and we were very impressed. We rarely go to a BBQ place and like all of their different sauces, but Black Dog has hit a home run with each and every one! Our favs were the mustard, Texas BBQ, Carolina red and Lexington dip. Brisket was awesome. The vinaigrette they make for the salads is super. And they had a great beer menu.We loved it and will definitely be making an excuse to do the 2.5 hour drive again!The only thing we wouldn't get again was the cornbread because it was very salty. But if you're a first-timer, you need to try it because it's so different!We loved it.", "Definitely recommend if you are in the area it's s real hole in the wall you better get here early though it gets busy! But the bbq is top notch! Try the burnt ends and ribs!", "The lines to get in are almost always long, which tells you something about the food. The burnt ends are out of this world, if you can get them. They make two batches a day. I think they are done at noon and 5 pm and they go pretty fast, for good reason.", "Worth the wait every time!  Brought visitors from Chicago and they said it beats anywhere in Chicago.  Cannot wait for the new place.  Hope they keep doing what they do now.", "Best bbq in champaign Urbana area. A long line. I love ribs and burger. Bun ends are great.", "Excellent, love this little quaint place.  This was my first time and I fell totally in love with this place.  It fills up fast but is worth the wait.  Their food was excellent.  I had the brisket.....best brisket ever!!!  I also had the corn bread....wonderful.  A must if u are in the area.  Too bad I'm over a hundred miles away.", "When I travel, I like to find the small local places in the hopes of discovering a gem and I found one tonight. I had the smoked catfish because 4 other items (brisket, burnt ends, ribs, and something else) were sold out, but it was right up my alley. The corn bread was absolutely awesome. Get there early if you want to full menu but be prepared to wait. They also have a wonderful beer selection to go along with your meal. The bartender seemed a little grouchy when I first arrived, but heck,  I am most of the time too, and I don't require much attention anyways. I will definitely be back and a BIG THANK YOU for a wonderful meal.", "Didnt live up the hype for me.", "Great bbq joint. You can't ask for better service. I can honestly say that if you ordered an appetizer, it may come after your meal.  Or just force them to not give you your food right away.  We ordered and in less than a minute our food was on the table. I compliment our waiter for messing up our order and bringing us the wrong side because he ended up bringing us the side that we actually ordered and let us keep the other.  That was deserving of generous tip for the nice fellow. Great BBQ, Better Service.", "Simply awesome. Incredible BBQ. Fantastic specials. Great drink selection. CANNOT GO WRONG. The biggest downside is the wait (often 30+ minutes). \\When you get there you write your name down on butcher paper and it is your job to know where you are on the list. You can't call ahead to make a reservation and they won't seat your till everyone in your party is there. But if you can get a seat you will not be disappointed. DONT leave champaign/urbana without having tried Black Dog", "Superb BBQ!  They have daily specials, but they also run out of certain items by lunchtime.  Speaking of lunchtime, be ready for a ~15 minute wait, even for a party of 2-3.  Once you're seated, the service is good, and the aforementioned BBQ makes it worth the wait.  I spotted a solid selection of craft beer; I'll have to come back for dinner.", "Black Dog is a staple of Champaign-Urbana by now. Coming from Texas, I didn't expect to find great BBQ, especially in Urbana, but I'm so glad I was wrong. The food here is fantastic and I recommend waiting out the long line to eat. It's well worth it. I highly recommend the Texas caviar as an appetizer. If I didn't care about my waistline I would order it every time. The burnt ends are good - there's a reason they sell out like crazy - but I don't think they're the best value for your money. I usually get the hot polish and brisket with the twice baked potato casserole and baked beans. The fries are also great, but I LOVE the potato casserole. You're missing out if you don't get it. My boyfriend loves the rib tips. I think they're the best value for your money, but I get annoyed putting that much effort into eating ;-)The sweet tea isn't great. I wouldn't order it if you're looking for legit sweet tea. The Carolina red sauce is my favorite. Black Dog switched their default sauce from that to the Lexington something other. Not sure why because I think the new default sauce isn't great at all. The Georgia peach is also good, but of you don't like sweet sauce stick with the Carolina. I will definitely miss Black Dog after leaving Champaign.", "Average meat, creative and tasty sides, disappointing sauces. I was impressed that they pack the place as soon as the doors open and start a waiting list. The meat was what I would expect from a BBQ place but without a good sauce I was disappointed. I tried 3 and didn't like any of them.", "This place is GOOD. As in, \"I don't eat meat but I eat BBQ at Black Dog\" good. I've been a  \"peskaterian/vegetarian\" for over 4 years but upon a recent trip down south decided to indulge in some good ol' southern BBQ, and well... I'm a little lax in the meat eating department now. At least when it comes quality, well cooked, BBQ. You wont see me scarfing down a McRib, or eating meat anywhere else for that matter but give me some Black Dog pulled pork and I'll make an exception. You walk in and write your name and party number on the sheet. I've been here twice now and it was spot on both times. You'll have to wait a little unless you get take out but it's worth it.They have different specials each night and tend to run out of stuff so go early if you have your heart set on the burnt ends (I've yet to try them because they were sold out both times).  First time I got the 1/2 rack of ribs with mac & cheese, and coleslaw.Second time they only had 1/4 rack of ribs so I got the pick two with the pulled pork, coleslaw, and baked beans. Pulled pork was amazing! Tender and smokey, and full of flavor. That will be my go to order now. Mac and cheese is indulgent and delicious, coleslaw is of the vinegar (not creamy) variety which I love. Baked beans (they call them something else) were good, but too heavy for me personally. I'd eat them again though. The ribs were my favorite until I tried the pulled pork. They're still a close second.I could be a good vegetarian and the get the portabello sandwich with fresh chevre and roasted red pepper that sounds amazing, and maybe I will one day when my conscience overcomes me. But there's something for everyone there, so non-meat eaters will be just as satisfied I'm sure.", "I was in town for business and the Black Dog was suggested by some of the locals. I ended up going two nights in a row. The first night I had the hot Polish sausage and the catfish. I'm not normally much of a fish eater, but it was so good I ended up having the catfish the second night as well, along with the brisket. The meats were perfectly cooked and so smoky and juicy that you really didn't need the sauces for either the flavor or moisture, although their sauces could have a review of their own. For the sides, I tried the smoked sweet potato, the cornbread, and the pit baked beans.  I'm always looking for baked beans with great flavor and most of the time I'm disappointed with sweet flavored beans that taste like they've come from the store. Black Dog's beans are the best I've had anywhere and I would go back just for the beans alone.   The smoky cornbread was exceptional, and the smoked sweet potato with just a touch of butter and brown sugar was amazing. Whenever I visit the Champaign-Urbana area (and by area I mean anywhere within a hundred miles!), the Black Dog will be my first stop for dinner.", "Might be the best BBQ joint in the Central Illinois area.Having relocated to Kansas City, the BBQ capital of the nation, and eating Oklahoma Joe's on a regular basis, Black Dogs would be a HUGE competitor in the KC area. It's a close 2 or 3 in my BBQ book (OK Joe's being number 1). For just being in a college town, I wish this restaurant got more publicity because their recipe is ROCK solid. I miss it every time I'm thinking of visiting my Alma Mater.Their ribs and burnt ends are my favorite. I like my meat fatty, and these meats are marbled well, and smoked well. The corn bread is also phenomenal. It's pretty big (I usually split with one other person). Lastly the sauce: everyone I've tried is true to its name. Try Carolina Red for a kick or Georgia Peach for some sweet sauce.", "Burnt ends and rib tips are to crave for! Go early to queue. Their cornbread has some pulled pork inside and it tastes nice!", "This place is goood!The meat is always fresh and tender and cooked just right. Everything I've ordered there, on multiple occasions, has been spot on and smoked just right. It's pretty interesting to see such a place in tiny downtown Champaign. The place looks and smells awesome too. Once you enter into the tiny grunge-designed restaurant, the smokey smell of meats will serve as an early indication that you've come to the right place. The only issue with Black Dog is the wait. It's such a tiny place that if you go there at most times of the day, you will have to wait a good deal for your table. I had to sometimes resort to ordering out; however, when you're not in too much of a hurry, the ambience will convince you to stick around.", "I hit Black Dog on the rave recommendations of several friends.  They speak the truth.  Black Dog is the bomb.*When you show up, you'll notice the place is packed.  Walk up to the slab of paper, grab a sharpie and write your name down.  You'll be called when there's room for you to begin your BBQuest.A sign near the entryway notified us they were out of burnt ends and mac 'n' cheese.  We mourned this loss and regrouped in time to be seated.Let's start with the cornbread.  You can order it as a side to your main dish or as an appetizer.  The appetizer portion ($2.95) is solid enough for two people.  The cornbread contains green chiles, pit beans, cheese and pulled pork.  Boom.  Regular bread is forever ruined.If you like sauces, Black Dog allows you to order a flight of all eight of theirs for just $2.  Milo's Mustard and Carolina Red were my favorite.For my main dish, I went with a 3 meat combo.  Ribs, chicken and brisket.  Chicken was my favorite.  Succulent, soft and juicy, it paired very nicely with any sauce, but it was a home run with the mustard.The ribs were appropriately soft and smoky.  I really loved these with the Carolina Red sauce.The brisket was good, but not particularly outstanding.I live in Chicago, but Black Dog is good enough to merit a two and a half hour drive.  If you're in the area, you have to check out this temple of meat!* Saying things are \"the bomb\" was a popular expression in the early 2000s.  Despite its rapid decline in coolness, some people still use it earnestly.  Others use it ironically.  You are free to decide the context in this review.", "Here we go again. The best part about work travel is they pick up the tab!Anyhow... By looking at the exterior of this place I would have never guessed it to harbor a BBQ-haven within. I arrived in on a rainy early afternoon and was surprised to see still a bit of a crowd. In hindsight, this is probably a sign that the Urbana folk love this place- and warranted.I was promptly seated at the bar and happy to see that they have an EXPANSIVE option of bourbon and rye to choose from; even some high quality stuff like Bookers. Additionally they had a good handful of on-tap options covering a variety of beer types. The bartender wasn't the warm and fuzzytype, however he was very prompt, attentive, and professional. I opted for the combo of two; 1/4 rack of ribs and beef brisket. For sides, corn bread and twice baked mashed potatoes. I'll have to say each were very flavorful with thee own unique taste. These both are definitely someone's home receipe and I approve. The cornbread itself is hearty and flavorful enough to TRUELY qualify as a side.Overall this is a great place without the steep price you generally run accross in a BBQ joint (that's including the bourbons). The quality to price ratio definitely leaves the patron winning in this transaction. Well don't Black Dog.... Well done.", "I am a BBQ fanatic, and I give every place at least one shot at winning me over. Let's just say Black Dog will be seeing a lot more of me! Our waitress was very helpful, happy and gave us good tips on what was good (apparently everything, from what we tried. The ribs were great. Pulled pork was really good. The sauces were \"OK\", but I could see myself learning to like them more. I didn't notice much dry rub, but it's a good sign when ribs aren't drowned in sauce. I liked their french fries a lot and my wife loved the twice baked potato casserole. Can't comment on the drink selection or bar. Overall it's a tight space and has a hip vibe, being in a university town you expect that usually. The bartender with the TIGHT fro (respect) was energized and really brought an upbeat vibe to the post lunch hour rush. Overall Black Dog was really good, bordering on great, for Illinois BBQ places, and I've been to a lot. We'll be back soon...", "I recently moved away from Urbana and had to bid farewell to Black Dog (at least inasmuch as I will be able to go there frequently). I never bothered to review Black Dog on Yelp because, frankly, what is there to add to the veritable torrent of 5-star reviews here.Last week, though, I had occasion to travel to Kansas City (the self-proclaimed BBQ capital of the world) and made every effort to take in the best the city had to offer (a set of restaurants that naturally varies greatly depending on the Kansas City resident being asked). I had ribs and brisket at Oklahoma Joe's (in the gas station); ribs and burnt ends at Arthur Bryant's; and ribs and a burnt end sandwich at Q39. All were good, some even great (Q39 especially), but--and here is the point of my review--I found myself thinking constantly of Black Dog even as I was downing these admittedly famous and stellar BBQ items.Black Dog, in my mind, is really unmatched in its ability to offer outstanding BBQ at all times of the day and across the entire menu. From the ribs and burnt ends to the pulled pork, pulled rib sandwich, pulled chicken, and brisket, everything is truly wonderful. The sides, too--from the twice-baked potato to the pit beans--are excellent.I will admit that Kansas City's Q39 beat Black Dog in one area: ribs. The ribs at Q39 were quite simply the best I've ever had. But, even at Q39, I found myself wishing for every other aspect of Black Dog: the sides (which were sorely lacking everywhere in Kansas City), the price, and the other BBQ items. Writing this is the only way I could think of to add something new to the many compliments and superlatives about Black Dog on Yelp. So yes: even after a BBQ journey to KC, I remain steadfast in my belief that Black Dog is, hands down, the best BBQ restaurant out there. It doesn't get caught up in or weighed down by tradition or legacy. Instead, it has every aspect of BBQ honed to perfection and is clearly the result of careful planning by the owners, taking as they must have the best elements of BBQ throughout the U.S. and putting them together under the moniker Black Dog Smoke and Ale House.", "This small eatery is generally very busy so be prepared to wait, especially at dinner hour.  IT IS WELL WORTH THE WAITDon't forget to go inside and put your name in the chalkboard.This is by far the BEST barbecue ever. Huge serving of pulled pork, brisket,  several combo plates.  Did I mention the sides. corn bread with pulled pork inside, loaded potato casserole, coleslaw like granny used to make!  Smoky, tender, juicy!  Several sauces to choose from-- from mild to HOT- ask for a sample or get the flyte offering to shareSeveral says a week Black Dog offers smoked turkey. It is amazing!If you are lucky you might get the \" burnt ends\". So far they are out each time I have visited. Decor is funky. Staff have all been excellent. Just the right balance of attention and very friendly, even on super busy Friday nights!!Try it. You will become a Black Dog addict!!", "My favorite BBQ spot. There is always line and sometimes you would have to wait for 1 hour. But with beers and cheers it's always worth the wait for the food you get at Black Dog!", "So... wow... this place was busy.I came to this place on a Wednesday night before the dinner rush and there was still a wait. The wait wasn't too bad, there was about 20-30 minutes before we were seated. This was at 5:45 pm. This place is apparently packed every night. So if you come here expect a wait... But wait. It's very worth it. So you walk up to free outside of this place and you can already smell the bbq smokey goodness. It only gets better from here. If you can get lucky enough to wait inside during a hot summer day... You're already doing pretty well. So you finally have a table. Grab a menu and order the burnt ends sandwich... I've never had anything like this before. I've had a lot of bbq coming from the south and living here the majority of my life. But the beef brisket here is amazing. It's more tender than any other beef brisket... drool... order it with the Carolina Red sauce. So good. Soooo good. The sweet potato fries are also good too. Corn bread... mmmm. The only thing that I could have done without is the slaw. Meh... I've had much better slaw, but in the sandwich is good. It compliments the rest of the flavors. Can we get back to that beef brisket? The end... get the burnt ends sandwich. That is all...", "Simply the tops. Black Dog presents to you the best BBQ in a 50-state area. Its welcoming and knowledgeable staff will serve you a rotating cast of beers and a stable of meats and sauces that rivals anywhere you've ever been. The burnt ends are probably considered to be the specialty here, and they're typically out of them by 1 or 2 due to the popularity, but the true specialty is just outstanding, mouthwatering food. Aside from the everyday options of pulled pork, brisket, ribs and catfish, they also have great daily specials, such as pork tacos on Tuesday and an incredible cuban sandwich on Wednesday. And not to be forgotten, the sides and appetizers are killer as well.The long wait at usual dinner and lunch hours is well documented, but there is a wait because everyone who's heard of the place dreams of eating all of their meals there, all of the time.If you're stopping in for the first time, you'll never go wrong with a cornbread appetizer, sides of pit beans and twice baked potato casserole, and pulled pork with the georgia peach sauce.", "woww, this place is TOP NOTCH! I had to give it 5 stars. I went to the University of Illinois at UC and during my four years there, I never heard of this place. WHAT A SHAME! I have truly missed out. I went there this past weekend after much hype from previous colleagues. The setting is just as you expect it.. always a wait [20-30 mins], very... barbequ-ie. You know, metal trays, easily cleanable, amazing smell, tasty beers, etc.Anyway, I heard so much about the burnt ends I had to get them. They only serve them twice a day. At least, this is what I am told. They have them when they open and they have them in the afternoon/dinner time. But once they run out, you'll have to wait til next time. :-( saddd face. Luckily, They had the burnt ends. Naturally, i ordered them. They were sooooo tender. I can't recall any other meat I've had in my LIFE as tender as these. They literally would fall apart when you picked them up. // Burnt ends - DEFINITELY get these. enough said. // Cornbread appetizer - easily the tastiest cornbread I've ever had. I think they put bacon in it? or some sort of meat. So soft and savory. It was very unique and definitely should be on your check. // Sauce flight - $2 - this is very cool for your first time but I wouldn't get it again. I wanted to try all the sauces but my favorite was the milos mustard. Also the vinegar one is great too. I forgot the name. I would get it your first time to kind of try all the sauces. // Sides - all of our sides were veryyyyy good. the FRENCH FRIES were amazing. They must be friend in pork fat. seriously, I have only had fries like that at one other place and they were fried in pure fat [or so i speculated]. Didn't get to try to sweet potato fries. The mac and cheese was good, a bit on the smaller portion.The only thing i didnt like... was the ribs. They were just a little bit to tough and didn't fall off the bone like i expected. I would opted out of these. But honestly, the burnt ends were so good that it didn't even matter what else I had.If you are every traveling through the champaign-urbana area... STOP AT THIS PLACE. Happy eating!"], "name": "Black Dog Smoke &amp; Ale House"}]